#貯金残高の概算

M = 1230000
Bonus = 500000

print('貯金残高の概算を行います。')
print('2020年9月 →　残金：123万円')
print('ボーナスは「50万円」とする。')

#現在の年月を入力
A = input('現在の年を入力してください。:')
A = int(A)
B = input('現在の月を入力してください。:')
B = int(B)

#入力された値をもとに計算

C = input('クレジットの平均支払額を入力してください。:')
C = int(C)

if A == 2020 and B == 12 :
    M_now = M + Bonus - (5800 + 12000 + 8800 + 13500 + 9300 + C - 180000)*(B - 9)

elif A == 2020 :
    M_now = M - (5800 + 12000 + 8800 + 13500 + 9300 + C - 180000)*(B - 9)

elif A == 2021 and B < 6 :
    M_now = M + Bonus - (5800 + 12000 + 8800 + 13500 + 9300 + C - 180000)*(B + 3)

elif A == 2021 and 6 <= B <12 :
    M_now = M + 2 * Bonus - (5800 + 12000 + 8800 + 13500 + 9300 + C - 180000)*(B + 3)

elif A == 2021 and B == 12 :
    M_now = M + 3 * Bonus - (5800 + 12000 + 8800 + 13500 + 9300 + C - 180000)*(B + 3)

#結果を出力
print('毎月かかる費用は以下の通りです。')

print('------------------------------------')
print('Softbank 携帯代　　9300円')
print('Softbank Wifi代　 5800円')
print('日本学生支援機構　　12000円')
print('宇都宮奨学金　　　　13500 + 8800円')
print('クレジット支払い(平均)　' + str(C) + '円')
print('------------------------------------')

print(str(A) + '年' + str(B) + '月' + 'の貯金残高は' + str(M_now) + '円です。')
